{
  "project_info": {
    "title": "سیرەی پێغەمبەر ﷺ",
    "subtitle": "گەشتێک بەنێو ژیانی پێشەوای مرۆڤایەتی لە سرووشەوە تا کۆچی دوایی",
    "footer_text": "هەموو مافێکی پارێزراوە بۆ پەرەپێدەر"
  },
  "events": [
    {
      "id": 1,
      "year": "٦١٠ زایینی",
      "age": "٤٠ ساڵ",
      "title": "سەرەتای دابەزینی سرووش (وەحی)",
      "icon": "📖",
      "description": "لە ئەشکەوتی حیرادا، فریشتە جوبرەیل (سەلامی خوای لێبێت) بۆ یەکەمجار دابەزی و یەکەم ئایەتی قورئانی پیرۆزی بە پێغەمبەر ﷺ گەیاند: 'اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ'. ئەمە سەرەتای پەیامی ئیسلام بوو."
    },
    {
      "id": 2,
      "year": "٦١٣ زایینی",
      "age": "٤٣ ساڵ",
      "title": "بانگەوازی ئاشکرا",
      "icon": "📣",
      "description": "دوای سێ ساڵ لە بانگەوازی نهێنی، خوای گەورە فەرمانی کرد بە بانگەوازی ئاشکرا. پێغەمبەر ﷺ لەسەر کێوی سەفاوە خەڵکی مەککەی کۆکردەوە و ئایینی یەکخواپەرستی پێ ڕاگەیاندن."
    },
    {
      "id": 3,
      "year": "٦١٥ زایینی",
      "age": "٤٥ ساڵ",
      "title": "کۆچی حەبەشە",
      "icon": "🌍",
      "description": "بەهۆی زۆربوونی ئازار و ئەشکەنجەی قوڕەیش، پێغەمبەر ﷺ مۆڵەتی دا بە کۆمەڵێک لە موسوڵمانان کە کۆچ بکەن بۆ حەبەشە (ئیتیۆپیا) چونکە پاشایەکی دادپەروەری لێبوو."
    },
    {
      "id": 4,
      "year": "٦١٩ زایینی",
      "age": "٤٩ ساڵ",
      "title": "ساڵی خەم (عام الحزن)",
      "icon": "💔",
      "description": "ساڵێکی زۆر سەخت بوو کە تێیدا خەدیجەی هاوسەری و ئەبو تالیبی مامی کۆچی دواییان کرد، کە دوو گەورەترین پاڵپشتی پێغەمبەر ﷺ بوون."
    },
    {
      "id": 5,
      "year": "٦٢٠ زایینی",
      "age": "٥٠ ساڵ",
      "title": "ئیسرا و میعراج",
      "icon": "🌌",
      "description": "گەشتێکی موعجیزەئاسا لە مەککەوە بۆ قودس و لەوێشەوە بۆ ئاسمانەکان. لەم شەوەدا پێنج نوێژە فەرزەکە واجب کران."
    },
    {
      "id": 6,
      "year": "٦٢٢ زایینی",
      "age": "٥٣ ساڵ",
      "title": "کۆچی پیرۆز (هـیجـرەت)",
      "icon": "🕌",
      "description": "خاڵی وەرچەرخان لە مێژووی ئیسلامدا. پێغەمبەر ﷺ و هاوەڵان کۆچیان کرد بۆ مەدینە (یەسریب) و یەکەم دەوڵەتی ئیسلامی دامەزرا."
    },
    {
      "id": 7,
      "year": "٦٢٤ زایینی",
      "age": "٥٥ ساڵ",
      "title": "جەنگی بەدر",
      "icon": "⚔️",
      "description": "یەکەم جەنگی گەورە لە نێوان موسوڵمانان و بێباوەڕانی قوڕەیش. سەرەڕای کەمی ژمارەیان، موسوڵمانان سەرکەوتنێکی گەورەیان بەدەست هێنا."
    },
    {
      "id": 8,
      "year": "٦٢٨ زایینی",
      "age": "٥٩ ساڵ",
      "title": "ڕێککەوتنامەی حودەیبیە",
      "icon": "🤝",
      "description": "ڕێککەوتنێکی ئاشتی ١٠ ساڵە لەگەڵ قوڕەیش کە بووە هۆی بڵاوبوونەوەی خێرای ئیسلام و ئارامی بۆ موسوڵمانان."
    },
    {
      "id": 9,
      "year": "٦٣٠ زایینی",
      "age": "٦١ ساڵ",
      "title": "فەتحی مەککە",
      "icon": "🕋",
      "description": "گەڕانەوەی سەرکەوتووانەی پێغەمبەر ﷺ بۆ مەککە بەبێ خوێنڕشتن و پاککردنەوەی کەعبە لە بتەکان."
    },
    {
      "id": 10,
      "year": "٦٣٢ زایینی",
      "age": "٦٣ ساڵ",
      "title": "حەجی ماڵئاوایی و وەفات",
      "icon": "🍃",
      "description": "پێغەمبەر ﷺ کۆتا وتاری خۆی پێشکەش کرد و ئایینی ئیسلامی تەواو کرد. چەند مانگێک دواتر، لە مەدینە کۆچی دوایی کرد و چووە بەر دلۆڤانی پەروەردگار."
    }
  ]
}
