{
  "project_info": {
    "title": "سیرەی پێغەمبەر ﷺ",
    "subtitle": "گەشتێکی قووڵ بەنێو ژیانی پێشەوای مرۆڤایەتی لە سرووشەوە تا بەهەشتی بەرین",
    "footer_text": "هەموو مافێکی پارێزراوە | ٢٠٢٥"
  },
  "events": [
    {
      "id": 1,
      "year": "٦١٠ ز",
      "age": "٤٠ ساڵ",
      "title": "سەرەتای دابەزینی سرووش (وەحی)",
      "icon": "📖",
      "description": "لە شەوێکی ئارامی ڕەمەزاندا لە ئەشکەوتی حینرا، فریشتە جوبرەیل دابەزی و یەکەم وشەی قورئانی پیرۆز 'اقْرَأْ'ی بە سینەی پیرۆزی پێغەمبەردا چرپاند. ئەم ڕووداوە بووە سەرەتای گۆڕینی مێژووی مرۆڤایەتی و ڕزگارکردنی مرۆڤ لە تاریکی نەزانی بۆ ڕووناکی زانست و ئیمان. پێغەمبەر بە ترس و لەرزەوە گەڕایەوە بۆ لای خەدیجە و داوای داپۆشینی کرد."
    },
    {
      "id": 2,
      "year": "٦١٠ ز",
      "age": "٤٠ ساڵ",
      "title": "یەکەمین موسوڵمانان",
      "icon": "🌱",
      "description": "دوای دابەزینی سرووش، یەکەم کەسەکان باوەڕیان پێ هێنا کە بریتی بوون لە خەدیجەی هاوسەری، ئەبو بەکری سدیق لە پیاوان، عەلی کوڕی ئەبو تالیب لە منداڵان، و زەیدی کوڕی حاریسە لە ئازادکراوان. ئەم کۆمەڵە بچووکە بوونە بناغەی پتەوی کۆمەڵگەی ئیسلامی و بە نهێنی پەرستشی خوایان دەکرد و قورئانیان دەخوێند."
    },
    {
      "id": 3,
      "year": "٦١٣ ز",
      "age": "٤٣ ساڵ",
      "title": "بانگەوازی ئاشکرا بۆ خزمە نزیکەکان",
      "icon": "📣",
      "description": "خوای گەورە فەرمانی کرد بە 'وَأَنذِرْ عَشِيرَتَكَ الْأَقْرَبِينَ'، بۆیە پێغەمبەر ﷺ خزم و کەسوکاری خۆی لە بەنو هاشم بانگهێشت کرد بۆ خوانێک و تێیدا بانگەوازی ئیسلامی پێ ڕاگەیاندن. هەرچەندە ئەبو لەهەبی مامی دژایەتی کرد، بەڵام عەلی کوڕی ئەبو تالیب پشتیوانی خۆی دەربڕی و ئەمە سەرەتای دەرکەوتنی بانگەواز بوو."
    },
    {
      "id": 4,
      "year": "٦١٣ ز",
      "age": "٤٣ ساڵ",
      "title": "بانگەواز لەسەر کێوی سەفا",
      "icon": "🏔️",
      "description": "پێغەمبەر ﷺ چووە سەر کێوی سەفا و بە دەنگی بەرز هاواری کرد 'یا صباحاه'، کە هێمایەک بوو بۆ ئاگادارکردنەوە لە مەترسی. کاتێک هۆزەکانی قوڕەیش کۆبوونەوە، پێی فەرموون: 'ئەگەر پێتان بڵێم سوپایەک لە پشت ئەم شاخەوەیە باوەڕم پێ دەکەن؟' وتیان بەڵێ، چونکە هەرگیز درۆمان لێت نەبیستووە. پاشان ئایینی یەکخواپەرستی پێ ڕاگەیاندن."
    },
    {
      "id": 5,
      "year": "٦١٤ ز",
      "age": "٤٤ ساڵ",
      "title": "دەستپێکردنی ئەشکەنجە و ئازار",
      "icon": "⛓️",
      "description": "کاتێک ژمارەی موسوڵمانان زیادی کرد، سەرانی قوڕەیش دەستیان کرد بە ئازاردانیان. بیلالی حەبەشییان لەسەر لمە گەرمەکانی مەککە ڕادەکێشا، یاسری و سومەییە بە دڕندانەترین شێوە شەهید کران. سەرەڕای ئەم ئەشکەنجە سەختانە، باوەڕی موسوڵمانان وەک چیایەک جێگیر بوو و کەسیان پاشگەز نەبوونەوە."
    },
    {
      "id": 6,
      "year": "٦١٥ ز",
      "age": "٤٥ ساڵ",
      "title": "کۆچی یەکەم بۆ حەبەشە",
      "icon": "🌍",
      "description": "بەهۆی زیادبوونی ستەم، پێغەمبەر ﷺ فەرمانی بە کۆمەڵێک لە هاوەڵان کرد (١٢ پیاو و ٤ ئافرەت) کە کۆچ بکەن بۆ حەبەشە. پێی فەرموون: 'لەوێ پاشایەک هەیە کە کەس لە سایەیدا ستەمی لێ ناکرێت'. عوسمانی کوڕی عەفان و ڕوقییەی کچی پێغەمبەر لەنێو کۆچبەران بوون."
    },
    {
      "id": 7,
      "year": "٦١٦ ز",
      "age": "٤٦ ساڵ",
      "title": "موسوڵمانبوونی حەمزە",
      "icon": "🦁",
      "description": "حەمزەی کوڕی عەبدولموتەلیب، مامی پێغەمبەر و پاڵەوانی ناسراوی قوڕەیش، کاتێک بیستی ئەبو جەهل سووکایەتی بە پێغەمبەر کردووە، تووڕە بوو و چوو لەبەردەم هەموواندا وتی 'منیش لەسەر ئایینی ئەوم'. موسوڵمانبوونی حەمزە قەڵغانێکی بەهێز بوو بۆ موسوڵمانان."
    },
    {
      "id": 8,
      "year": "٦١٦ ز",
      "age": "٤٦ ساڵ",
      "title": "موسوڵمانبوونی عومەری کوڕی خەتتاب",
      "icon": "⚔️",
      "description": "عومەر کە یەکێک بوو لە سەرسەختترین دوژمنانی ئیسلام، بە بیستنی ئایەتەکانی سەرەتای سورەتی تەها دڵی نەرم بوو و چوو بۆ لای پێغەمبەر و موسوڵمان بوو. ئیبنو مەسعود دەڵێت: 'موسوڵمانبوونی عومەر سەرکەوتن بوو، کۆچکردنەکەی یارمەتی بوو، و دەسەڵاتەکەی ڕەحمەت بوو'."
    },
    {
      "id": 9,
      "year": "٦١٦-٦١٩ ز",
      "age": "٤٦-٤٩ ساڵ",
      "title": "گەمارۆی دۆڵی ئەبو تالیب",
      "icon": "🚫",
      "description": "قوڕەیش پەیماننامەیەکی ستەمکارانەیان نووسی بۆ بڕینی هەموو پەیوەندییەکی بازرگانی و کۆمەڵایەتی لەگەڵ بەنو هاشم. سێ ساڵ گەمارۆی ئابووری سەخت خرایە سەریان تا ڕادەیەک ناچار بوون گەڵای درەخت بخۆن. ئەم گەمارۆیە بە موعجیزەی خواردنی پەیماننامەکە لەلایەن مێروولەوە کۆتایی هات."
    },
    {
      "id": 10,
      "year": "٦١٩ ز",
      "age": "٤٩ ساڵ",
      "title": "ساڵی خەم (عام الحزن)",
      "icon": "💔",
      "description": "ساڵێکی پڕ لە ماتەم بوو بۆ پێغەمبەر ﷺ، چونکە سەرەتا ئەبو تالیبی مامی و پارێزەری سیاسی کۆچی دوایی کرد، و دوای ماوەیەکی کەم خەدیجەی هاوسەری و گەورەترین پشتیوانی دەروونی وەفاتی کرد. ئەم دوو ڕووداوە خەمێکی قووڵیان خستە دڵی پێغەمبەرەوە."
    },
    {
      "id": 11,
      "year": "٦١٩ ز",
      "age": "٤٩ ساڵ",
      "title": "سەفەری تائیف",
      "icon": "⛰️",
      "description": "بە ئومێدی دۆزینەوەی پشتیوانی، پێغەمبەر ڕووی کردە شاری تائیف. بەڵام سەرانی سەقیف نەک تەنها ڕەتیان کردەوە، بەڵکو منداڵ و شێتەکانیان تێ بەردا تا بەردبارانیان کرد و خوێن لە جەستەی پیرۆزی دەچۆڕایە ناو نەعلەکانی. لەوێ دوعا بەناوبانگەکەی کرد: 'اللهم إليك أشكو ضعف قوتي...'."
    },
    {
      "id": 12,
      "year": "٦٢٠ ز",
      "age": "٥٠ ساڵ",
      "title": "دیداری جنۆکەکان",
      "icon": "👻",
      "description": "لە کاتی گەڕانەوە لە تائیف لە شوێنێک بە ناوی نەخلە، کۆمەڵێک لە جنۆکە گوێیان لە قورئان خوێندنی پێغەمبەر بوو و باوەڕیان پێ هێنا. خوای گەورە لە قورئاندا باسی ئەمەی کردووە لە سورەتی 'الجن'، کە دەریدەخات پەیامی ئیسلام بۆ هەردوو بەرەی مرۆڤ و جنۆکەیە."
    },
    {
      "id": 13,
      "year": "٦٢٠ ز",
      "age": "٥٠ ساڵ",
      "title": "ئیسرا و میعراج",
      "icon": "🌌",
      "description": "وەک دڵنەواییەک بۆ پێغەمبەر، خوای گەورە شەوڕەوییەکی موعجیزەئاسای بۆ ڕێکخست لە مەککەوە بۆ قودس، و لەوێشەوە بۆ حەوت چینی ئاسمان. لەم سەفەرەدا بەهەشت و دۆزەخی بینی و پێنج نوێژە فەرزەکە لەلایەن خوداوە بە دیاری پێ بەخشرا."
    },
    {
      "id": 14,
      "year": "٦٢١ ز",
      "age": "٥١ ساڵ",
      "title": "پەیمانی عەقەبەی یەکەم",
      "icon": "🤝",
      "description": "لە وەرزی حەجدا، ١٢ پیاو لە خەڵکی یەسریب (مەدینە) لە عەقەبە لەگەڵ پێغەمبەر کۆبوونەوە و بەیعەتیان پێ دا کە شەریک بۆ خوا دانەنێن، دزی و زینا نەکەن، و منداڵەکانیان نەکوژن. پێغەمبەر موسعەبی کوڕی عومەیری لەگەڵ ناردن بۆ فێرکردنی قورئان."
    },
    {
      "id": 15,
      "year": "٦٢٢ ز",
      "age": "٥٢ ساڵ",
      "title": "پەیمانی عەقەبەی دووەم",
      "icon": "🛡️",
      "description": "ساڵێک دواتر، شاندێکی گەورەتر کە لە ٧٣ پیاو و ٢ ئافرەت پێکهاتبوو هاتن و پەیمانی 'جەنگ' و پاراستنیان بە پێغەمبەر دا، بەو مەرجەی بەهەشت پاداشتیان بێت. عەباسی مامی پێغەمبەر (کە هێشتا موسوڵمان نەبوو) ئامادە بوو بۆ دڵنیابوون لە ڕاستگۆییان."
    },
    {
      "id": 16,
      "year": "٦٢٢ ز",
      "age": "٥٣ ساڵ",
      "title": "کۆچی پیرۆز (هـیجـرەت)",
      "icon": "🐪",
      "description": "دوای بڕیاری کوشتنی پێغەمبەر لەلایەن پەرلەمانی قوڕەیش (دار الندوة)، پێغەمبەر و ئەبو بەکر بە نهێنی مەککەیان بەجێهێشت و لە ئەشکەوتی سەور سێ ڕۆژ خۆیان حەشار دا. ئەم ڕووداوە بووە خاڵی وەرچەرخان و سەرەتای دامەزراندنی دەوڵەتی ئیسلامی و ڕۆژژمێری کۆچی."
    },
    {
      "id": 17,
      "year": "٦٢٢ ز",
      "age": "٥٣ ساڵ",
      "title": "گەیشتن بە قوباء",
      "icon": "🌴",
      "description": "پێغەمبەر گەیشتە ناوچەی قوباء لە دەوروبەری مەدینە و چەند ڕۆژێک لەوێ مایەوە. لەو ماوەیەدا یەکەم مزگەوتی لە ئیسلامدا بە دەستەکانی خۆی بناغەکەی دانا، کە لە قورئاندا بە 'مزگەوتێک کە لەسەر تەقوا دامەزراوە' وەسف کراوە."
    },
    {
      "id": 18,
      "year": "٦٢٢ ز",
      "age": "٥٣ ساڵ",
      "title": "پێشوازی مەدینە و مزگەوتی نەبەوی",
      "icon": "🕌",
      "description": "خەڵکی مەدینە بە سروودی 'طلع البدر علينا' پێشوازییەکی مێژووییان لە پێغەمبەر کرد. وشترەکەی لە زەوییەکی بەتاڵدا چۆکی دادا کە بووە شوێنی مزگەوتی پیرۆزی نەبەوی و ماڵی پێغەمبەر، و بووە ناوەندی بەڕێوەبردنی دەوڵەتی ئیسلامی."
    },
    {
      "id": 19,
      "year": "٦٢٣ ز",
      "age": "٥٤ ساڵ",
      "title": "برایەتی نێوان کۆچەران و پشتیوانان",
      "icon": "👬",
      "description": "یەکێک لە شاکارە کۆمەڵایەتییەکانی پێغەمبەر، دروستکردنی برایەتی بوو لە نێوان موهاجیرین (کۆچەران) و ئەنسار (پشتیوانان). ئەنسارەکان نیوەی ماڵ و سامانی خۆیان بەخشی بە برا کۆچەرەکانیان، کە نموونەیەکە لە هاوسۆزی کە مێژوو هاوشێوەی نەبینیوە."
    },
    {
      "id": 20,
      "year": "٦٢٣ ز",
      "age": "٥٤ ساڵ",
      "title": "دەستووری مەدینە (صحیفة المدينة)",
      "icon": "📜",
      "description": "پێغەمبەر ﷺ یەکەم دەستووری نووسراوی لە مێژوودا دانا بۆ ڕێکخستنی پەیوەندی نێوان موسوڵمانان، جولەکەکان، و هۆزەکانی تر. ئەم بەڵگەنامەیە مافی هاوڵاتیبوون، ئازادی ئایین، و بەرگری هاوبەشی لە مەدینە چەسپاند."
    },
    {
      "id": 21,
      "year": "٦٢٤ ز",
      "age": "٥٥ ساڵ",
      "title": "گۆڕینی قیبلە",
      "icon": "🧭",
      "description": "دوای ١٦-١٧ مانگ لە نوێژکردن بەرەو قودس، لە کاتی نوێژی نیوەڕۆدا لە مزگەوتی بەنو سەلیمە، فەرمانی خوایی هات بۆ گۆڕینی قیبلە بەرەو کەعبەی پیرۆز لە مەککە. ئەمە تاقیکردنەوەیەک بوو بۆ موسوڵمانان و جیاکردنەوەیان لە جولەکەکان."
    },
    {
      "id": 22,
      "year": "٦٢٤ ز",
      "age": "٥٥ ساڵ",
      "title": "جەنگی بەدر",
      "icon": "⚔️",
      "description": "یەکەم جەنگی یەکلاکەرەوە بوو. سوپای ئیسلام (٣١٣ کەس) بەرامبەر سوپای قوڕەیش (١٠٠٠ کەس). سەرەڕای کەمی ژمارە و چەک، خوای گەورە بە فریشتە یارمەتی دان و موسوڵمانان سەرکەوتنێکی گەورەیان بەدەست هێنا و گەورە سەرانی قوڕەیش وەک ئەبو جەهل کوژران."
    },
    {
      "id": 23,
      "year": "٦٢٤ ز",
      "age": "٥٥ ساڵ",
      "title": "جەنگی بەنو قەینوقاع",
      "icon": "✡️",
      "description": "دوای بەدر، جولەکەکانی بەنو قەینوقاع پەیمانیان شکاند و سووکایەتییان بە ئافرەتێکی موسوڵمان کرد. پێغەمبەر گەمارۆی دان و لە کۆتاییدا لە مەدینە دەریان کرد، کە ئەمە یەکەم هەنگاو بوو بۆ پاککردنەوەی مەدینە لە خیانەتکاران."
    },
    {
      "id": 24,
      "year": "٦٢٥ ز",
      "age": "٥٦ ساڵ",
      "title": "جەنگی ئوحود",
      "icon": "🏔️",
      "description": "قوڕەیش بۆ تۆڵەسەندنەوەی بەدر هاتن. لە سەرەتادا موسوڵمانان سەرکەوتن، بەڵام بەهۆی دابەزینی تیرهاوێژەکان لە گردەکە بۆ غەنیمەت، خالیدی کوڕی وەلید لە دواوە هێرشی کرد. لەم جەنگەدا حەمزەی مامی پێغەمبەر شەهید بوو و ددانی پێغەمبەر شکا."
    },
    {
      "id": 25,
      "year": "٦٢٥ ز",
      "age": "٥٦ ساڵ",
      "title": "ڕووداوی ڕەجیع و بیر مەعوونە",
      "icon": "🥀",
      "description": "دوو کارەساتی دڵتەزێن بوون کە تێیدا کۆمەڵێک لە باشترین قورئان خوێنەکانی (قوڕڕاع) هاوەڵان بە خیانەت شەهید کران لەلایەن هۆزە عەرەبەکانەوە. ئەمە خەمێکی گەورەی خستە دڵی پێغەمبەرەوە و مانگێک دوعای (قنوت)ی لە دژی بکوژانیان کرد."
    },
    {
      "id": 26,
      "year": "٦٢٥ ز",
      "age": "٥٦ ساڵ",
      "title": "جەنگی بەنو نەزیر",
      "icon": "🏰",
      "description": "جولەکەکانی بەنو نەزیر پیلانیان دانا بۆ کوشتنی پێغەمبەر بە بەردبارانکردنی لە سەربانەوە. جوبرەیل پیلانەکەی ئاشکرا کرد و پێغەمبەر گەمارۆی دان تا ناچار بوون چەکەکانیان دابنێن و مەدینە جێبهێڵن بەرەو خەیبەر."
    },
    {
      "id": 27,
      "year": "٦٢٦ ز",
      "age": "٥٧ ساڵ",
      "title": "جەنگی زاتولریقاع",
      "icon": "👣",
      "description": "لەم هەڵمەتەدا بۆ سەر هۆزە نەجدییەکان، نوێژی ترس (صلاة الخوف) بۆ یەکەمجار دابەزی. ناونرا 'خاوەن پەڕۆکان' چونکە سەربازەکان بەهۆی دڕانی پێڵاوەکانیانەوە پەڕۆیان لە پێیەکانیان دەپێچا."
    },
    {
      "id": 28,
      "year": "٦٢٧ ز",
      "age": "٥٨ ساڵ",
      "title": "جەنگی خەندەق (ئەحزاب)",
      "icon": "🏗️",
      "description": "گەورەترین هاوپەیمانی دژی ئیسلام (١٠,٠٠٠ سەرباز) هاتنە سەر مەدینە. بە پێشنیاری سەلمانی فارسی، خەندەقێک لە دەوری مەدینە هەڵکەندرا. دوای مانگێک گەمارۆ و برسێتی، خوای گەورە ڕەشەبایەکی ساردی نارد کە خێمەکانی دوژمنی هەڵتەکاند و شکستیان هێنا."
    },
    {
      "id": 29,
      "year": "٦٢٧ ز",
      "age": "٥٨ ساڵ",
      "title": "سزای بەنو قورەیزە",
      "icon": "⚖️",
      "description": "لە کاتی جەنگی خەندەق، جولەکەکانی بەنو قورەیزە پەیمانیان شکاند و هەوڵیان دا لە دواوە هێرش بکەنە سەر ژن و منداڵی موسوڵمانان. دوای شکستپێهێنانی ئەحزاب، سزای دادپەروەرانەیان بەسەردا سەپێنرا بەپێی تەوڕاتی خۆیان."
    },
    {
      "id": 30,
      "year": "٦٢٧ ز",
      "age": "٥٨ ساڵ",
      "title": "هاوسەرگیری لەگەڵ زەینەبی کچی جەحش",
      "icon": "💍",
      "description": "بە فەرمانی خوای گەورە، پێغەمبەر ﷺ هاوسەرگیری لەگەڵ زەینەب کرد بۆ هەڵوەشاندنەوەی دابونەریتی جاهیلی کە ڕێگری لە هاوسەرگیری لەگەڵ ژنی پێشووی کوڕی هەڵگیراوە دەکرد. لێرەدا حیجابیش فەرز کرا."
    },
    {
      "id": 31,
      "year": "٦٢٨ ز",
      "age": "٥٩ ساڵ",
      "title": "ڕێککەوتنامەی حودەیبیە",
      "icon": "🕊️",
      "description": "پێغەمبەر بە نیاز بوو عومرە بکات بەڵام قوڕەیش ڕێگرییان کرد. لە حودەیبیە ڕێککەوتنێکی ١٠ ساڵە واژۆ کرا. هەرچەندە مەرجەکان لە ڕواڵەتدا قورس بوون، بەڵام قورئان بە 'فەتحێکی ئاشکرا' ناوی برد و بووە هۆی بڵاوبوونەوەی خێرای ئیسلام."
    },
    {
      "id": 32,
      "year": "٦٢٨ ز",
      "age": "٥٩ ساڵ",
      "title": "پەیمانی ڕیزوان",
      "icon": "🌳",
      "description": "لە حودەیبیە، دەنگۆی کوشتنی عوسمانی کوڕی عەفان بڵاوبووەوە. ١٤٠٠ هاوەڵ لەژێر درەختێکدا پەیمانی مەرگیان بە پێغەمبەر دا بۆ تۆڵەسەندنەوە. خوای گەورە ڕەزامەندی خۆی لەسەر ئەم کۆمەڵە لە قورئاندا دەربڕی."
    },
    {
      "id": 33,
      "year": "٦٢٨ ز",
      "age": "٥٩ ساڵ",
      "title": "فەتحی خەیبەر",
      "icon": "🏰",
      "description": "دوای ئارامبوونەوە لەلایەن قوڕەیشەوە، پێغەمبەر ڕووی کردە خەیبەر کە مەڵبەندی سەرەکی پیلانگێڕی جولەکەکان بوو. بە قارەمانێتی عەلی کوڕی ئەبو تالیب، قەڵا سەختەکانیان فەتح کرا و مەترسییان لەسەر دەوڵەتی ئیسلامی کۆتایی هات."
    },
    {
      "id": 34,
      "year": "٦٢٨ ز",
      "age": "٥٩ ساڵ",
      "title": "گەڕانەوەی جەعفەر و کۆچەرانی حەبەشە",
      "icon": "⛵",
      "description": "لە ڕۆژی فەتحی خەیبەردا، جەعفەری کوڕی ئەبو تالیب و هاوەڵانی دوای ساڵانێک لە غەریبی گەڕانەوە. پێغەمبەر زۆر دڵخۆش بوو و فەرمووی: 'نازانم بە کامیان دڵخۆشتر بم، بە فەتحی خەیبەر یان بە هاتنەوەی جەعفەر'."
    },
    {
      "id": 35,
      "year": "٦٢٩ ز",
      "age": "٦٠ ساڵ",
      "title": "عومرەی قەزا (عمرة القضاء)",
      "icon": "🕋",
      "description": "بەپێی ڕێککەوتنی حودەیبیە، موسوڵمانان چوونە مەککە بۆ ئەنجامدانی عومرە. قوڕەیش چۆڵیان کرد و لە بەرزاییەکانەوە سەیری دیمەنی شکۆداری تەواف و سەعی موسوڵمانانیان دەکرد، کە کاریگەرییەکی زۆری لەسەر دڵیان هەبوو."
    },
    {
      "id": 36,
      "year": "٦٢٩ ز",
      "age": "٦٠ ساڵ",
      "title": "نامە بۆ پاشاکانی جیهان",
      "icon": "✉️",
      "description": "پێغەمبەر ﷺ ئاستی بانگەوازی گەیاندە جیهان و نامەی نارد بۆ قەیسەری ڕۆم، کیسرای فارس، موقەوقیسی میسر و نەجاشی حەبەشە. هەرچەندە کاردانەوەکان جیاواز بوون، بەڵام ئەمە پەیامی ئیسلامی بە جیهان ناساند."
    },
    {
      "id": 37,
      "year": "٦٢٩ ز",
      "age": "٦٠ ساڵ",
      "title": "ئیسلامبوونی خالید و عەمر",
      "icon": "⚔️",
      "description": "خالیدی کوڕی وەلید (سەیفولئیسلام) و عەمری کوڕی عاس، دوو سەرکردەی سەربازی و سیاسی قوڕەیش، هاتنە مەدینە و موسوڵمان بوون. ئەمە گورزێکی گەورە بوو لە هێزی قوڕەیش و بەهێزبوونی بەرچاو بۆ سوپای ئیسلام."
    },
    {
      "id": 38,
      "year": "٦٢٩ ز",
      "age": "٦٠ ساڵ",
      "title": "جەنگی موئتە",
      "icon": "🚩",
      "description": "یەکەم پێکدادان لەگەڵ ئیمپراتۆریەتی ڕۆم. ٣٠٠٠ موسوڵمان بەرامبەر ٢٠٠,٠٠٠ ڕۆمی. لەم جەنگەدا سێ سەرکردە (زەید، جەعفەر، عەبدوڵڵا) شەهید بوون، و خالیدی کوڕی وەلید بە پلانێکی زیرەکانە سوپاکەی ڕزگار کرد."
    },
    {
      "id": 39,
      "year": "٦٢٩ ز",
      "age": "٦٠ ساڵ",
      "title": "جەنگی زاتوسەلاسیل",
      "icon": "⛓️",
      "description": "هەڵمەتێکی سەربازی بوو بە سەرکردایەتی عەمری کوڕی عاس بۆ باکووری نیمچە دورگەی عەرەبی. ئەم سەرکەوتنە هۆزەکانی ئەو ناوچەیەی ملکەچی دەسەڵاتی مەدینە کرد و ئاسایشی سنوورەکانی باکووری مسۆگەر کرد."
    },
    {
      "id": 40,
      "year": "٦٣٠ ز",
      "age": "٦١ ساڵ",
      "title": "فەتحی مەککە",
      "icon": "🕋",
      "description": "دوای شکاندنی پەیمانی حودەیبیە لەلایەن قوڕەیشەوە، پێغەمبەر بە سوپایەکی ١٠,٠٠٠ کەسییەوە بەرەو مەککە ڕۆیشت. شارەکە بەبێ خوێنڕشتن فەتح کرا، بتەکان تێکشکێنران، و لێخۆشبوونی گشتی بۆ خەڵکەکەی ڕاگەیەندرا بە وتەی 'لا تثريب عليكم اليوم'."
    },
    {
      "id": 41,
      "year": "٦٣٠ ز",
      "age": "٦١ ساڵ",
      "title": "جەنگی حونەین",
      "icon": "🏹",
      "description": "ڕاستەوخۆ دوای فەتحی مەککە، هۆزەکانی هەوازین و سەقیف هێرشیان کرد. لە سەرەتادا موسوڵمانان بەهۆی زۆری ژمارەیانەوە تووشی لەخۆبایی بوون و شکان، بەڵام دواتر بە جێگیری پێغەمبەر و هاوەڵە دڵسۆزەکان سەرکەوتن و غەنیمەتێکی زۆریان دەستکەوت."
    },
    {
      "id": 42,
      "year": "٦٣٠ ز",
      "age": "٦١ ساڵ",
      "title": "گەمارۆی تائیف",
      "icon": "🏰",
      "description": "پێغەمبەر ﷺ بەدوای سوپای شکستخواردووی حونەین کەوت تا شاری تائیف و گەمارۆی دان. هەرچەندە شارەکە فەتح نەبوو، بەڵام دوعای بۆ هیدایەتیان کرد. ساڵێک دواتر خەڵکی تائیف خۆیان هاتن و موسوڵمان بوون."
    },
    {
      "id": 43,
      "year": "٦٣٠ ز",
      "age": "٦١ ساڵ",
      "title": "جەنگی تەبووک",
      "icon": "☀️",
      "description": "کۆتا غەزای پێغەمبەر ﷺ بوو لە دژی ڕۆمەکان لە وەرزی گەرمایەکی سەختدا (جییش العسرة). ٣٠,٠٠٠ موسوڵمان بەشدارییان کرد. هەرچەندە جەنگ ڕووی نەدا چونکە ڕۆمەکان پاشەکشەیان کرد، بەڵام هێزی دەوڵەتی ئیسلامی بەسەر هەموو ناوچەکەدا چەسپاند."
    },
    {
      "id": 44,
      "year": "٦٣٠ ز",
      "age": "٦١ ساڵ",
      "title": "سووتاندنی مزگەوتی زیڕار",
      "icon": "🔥",
      "description": "دوای گەڕانەوە لە تەبووک، پێغەمبەر فەرمانی کرد بە سووتاندنی مزگەوتێک کە مونافیقەکان دروستیان کردبوو بۆ پیلانگێڕی و دابەشکردنی موسوڵمانان. ئەمە وانەیەک بوو کە پیرۆزی شوێن مانای نییە ئەگەر نییەتەکەی پیس بێت."
    },
    {
      "id": 45,
      "year": "٦٣١ ز",
      "age": "٦٢ ساڵ",
      "title": "ساڵی شاندەکان (عام الوفود)",
      "icon": "🤝",
      "description": "ساڵێک بوو کە تێیدا نوێنەری زۆربەی هۆزەکانی عەرەب لە هەموو لایەکەوە ڕوویان کردە مەدینە بۆ ڕاگەیاندنی ئیسلامبوونیان و بەیعەت دان بە پێغەمبەر. نیمچە دورگەی عەرەبی بۆ یەکەمجار لە مێژوودا لەژێر یەک ئاڵادا یەکی گرت."
    },
    {
      "id": 46,
      "year": "٦٣١ ز",
      "age": "٦٢ ساڵ",
      "title": "حەجی ئەبو بەکر",
      "icon": "📜",
      "description": "پێغەمبەر ﷺ ئەبو بەکری کردە ئەمیری حەج و عەلی نارد بۆ خوێندنەوەی سورەتی (تەوبە)، کە تێیدا ڕاگەیەندرا لەمەودوا موشریکەکان بۆیان نییە حەج بکەن و کەس بۆی نییە بە ڕووتی تەواف بکات."
    },
    {
      "id": 47,
      "year": "٦٣٢ ز",
      "age": "٦٣ ساڵ",
      "title": "حەجی ماڵئاوایی (حجة الوداع)",
      "icon": "🕋",
      "description": "یەکەم و کۆتا حەجی پێغەمبەر ﷺ بە بەشداری زیاتر لە ١٠٠,٠٠٠ موسوڵمان. تێیدا بنەماکانی ئیسلامی بە تەواوی ڕوونکردەوە و مافی مرۆڤ، مافی ژنان، و حەرامی خوێن و ماڵی موسوڵمانی چەسپاند."
    },
    {
      "id": 48,
      "year": "٦٣٢ ز",
      "age": "٦٣ ساڵ",
      "title": "وتاری ماڵئاوایی و تەواوبوونی ئایین",
      "icon": "📣",
      "description": "لە عەرەفە، ئایەتی 'الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ' دابەزی. پێغەمبەر شاهیدی لە خەڵک وەرگرت کە پەیامەکەی گەیاندووە و فەرمووی: 'ئەوانەی لێرەن با بەوانەی بگەیەنن کە لێرە نین'. ئەم وتارە بووە دەستووری کۆتایی ئیسلام."
    },
    {
      "id": 49,
      "year": "٦٣٢ ز",
      "age": "٦٣ ساڵ",
      "title": "نەخۆشکەوتنی پێغەمبەر ﷺ",
      "icon": "🤒",
      "description": "لە مانگی سەفەردا، پێغەمبەر تووشی سەرئێشە و تا بوو. داوای کرد لە ماڵی عائیشە بمێنێتەوە. لەم ماوەیەدا فەرمانی بە ئەبو بەکر کرد کە پێشنوێژی بۆ خەڵک بکات، کە ئاماژەیەک بوو بۆ جێنشینی."
    },
    {
      "id": 50,
      "year": "٦٣٢ ز",
      "age": "٦٣ ساڵ",
      "title": "کۆچی دوایی و بەخاكسپاردن",
      "icon": "🍃",
      "description": "لە ١٢ی ڕەبیعولئەووەڵ، لە باوەشی عائیشەدا، پێغەمبەر ﷺ کۆتا وشەکانی فەرموو: 'بەڵکو بۆ لای هاوڕێی هەرە بەرز (اللهم الرفيق الأعلى)'. مەدینە تاریک داهات و هاوەڵان تووشی شۆک بوون. لە هەمان ژووری عائیشەدا بە خاک سپێردرا."
    }
  ]
}
